lokii2310/Simple_stm32_projects/stm32nucleo-L476RG_DRIVERS/Drivers/Src/stm32nul476rg_gpio_driver.c
/*
 * stm32nul476rg_gpio_driver.c
 *
 *  Created on: Aug 10, 2024
 *      Author: hp
 */


#include "stm32nul476rg_gpio_driver.h"



/*
 *
 */

void GPIO_PeriClockControl(GPIO_RegDef_t *pGPIOx, uint8_t EnorDi)
{
	if(EnorDi == ENABLE)
	{
		if(pGPIOx == GPIOA)
		{
			GPIOA_PCLK_EN();
		}
		else if(pGPIOx ==GPIOB)
		{
			GPIOB_PCLK_EN();
		}
		else if(pGPIOx ==GPIOC)
		{
			GPIOC_PCLK_EN();
		}
		else if(pGPIOx ==GPIOD)
		{
			GPIOD_PCLK_EN();
		}
		else if(pGPIOx ==GPIOE)
		{
			GPIOE_PCLK_EN();
		}
		else if(pGPIOx ==GPIOF)
		{
			GPIOF_PCLK_EN();
		}
		else if(pGPIOx ==GPIOG)
		{
			GPIOG_PCLK_EN();
		}
		else if(pGPIOx ==GPIOH)
		{
			GPIOH_PCLK_EN();
		}
	}
	else
	{
		if(pGPIOx == GPIOA)
		{
			GPIOA_PCLK_DI();
		}
		else if(pGPIOx ==GPIOB)
		{
			GPIOB_PCLK_DI();
		}
		else if(pGPIOx ==GPIOC)
		{
			GPIOC_PCLK_DI();
		}
		else if(pGPIOx ==GPIOD)
		{
			GPIOD_PCLK_DI();
		}
		else if(pGPIOx ==GPIOE)
		{
			GPIOE_PCLK_DI();
		}
		else if(pGPIOx ==GPIOF)
		{
			GPIOF_PCLK_DI();
		}
		else if(pGPIOx ==GPIOG)
		{
			GPIOG_PCLK_DI();
		}
		else if(pGPIOx ==GPIOH)
		{
			GPIOH_PCLK_DI();
		}
	}

}







void GPIO_Init(GPIO_Handle_t *pGPIOHandle)
{
	uint32_t temp=0;
	//enable periclock
	GPIO_PeriClockControl(pGPIOHandle->pGPIOx, ENABLE);

	//1. Configure the mode of the GPIO pin

	if (pGPIOHandle->GPIO_PinConfig.GPIO_PinMode<= GPIO_MODE_ANALOG)
	{
		//the non interrupt mode of GPIO pGPIOx->MODER &= ~(0x3 << (2 * PinNumber));

		temp=(pGPIOHandle->GPIO_PinConfig.GPIO_PinMode <<(2 * pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber));
		pGPIOHandle->pGPIOx->MODER &=~(0x3 << 2*pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber);		//clearing
		pGPIOHandle->pGPIOx->MODER |= temp;														//setting
		temp=0;
	}
	else{
		//Interrupt mode
		if(pGPIOHandle->GPIO_PinConfig.GPIO_PinMode == GPIO_MODE_IT_FT)
		{
			//Configure the FTSR
			EXTI->FTSR1 |= (1 << pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber);
			//C;ear the corresponding RTSR bit
			EXTI->RTSR1 &= ~(1 << pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber);

		}
		else if(pGPIOHandle->GPIO_PinConfig.GPIO_PinMode == GPIO_MODE_IT_RT)
		{
			//Configure the RTSR
			EXTI->FTSR1 &= ~(1 << pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber);
			//Clear the corresponding RTSR bit
			EXTI->RTSR1 |= (1 << pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber);
		}
		else if(pGPIOHandle->GPIO_PinConfig.GPIO_PinMode == GPIO_MODE_IT_RFT)
		{
			//Configure both FTR and RTSR
			EXTI->FTSR1 |= (1 << pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber);
			//Set the corresponding RTSR bit
			EXTI->RTSR1 |= (1 << pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber);
		}
		//2. Configure the GPIO port selection in SYSFG_EXTICR
		uint8_t temp1 = pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber /4;
		uint8_t temp2 = pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber %4;
		uint8_t portcode = GPIO_BASEADDR_TO_CODE(pGPIOHandle->pGPIOx);
		SYSCFG_PCLK_EN();
		SYSCFG->EXTICR[temp1]=portcode << (temp2*4);

		//3. Enable the exti interrupt delivery using IMR
		EXTI->IMR1 |= 1 << pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber;
	}

	temp=0;
	//2. Configure the speed
	temp= (pGPIOHandle->GPIO_PinConfig.GPIO_PinSpeed <<(2 *pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber));
	pGPIOHandle->pGPIOx->OSPEEDR &=~(0x3 << 2*pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber);			//clearing
	pGPIOHandle->pGPIOx->OSPEEDR |= temp;														//setting

	temp=0;
	//3. Configure the pupd settings
	temp= (pGPIOHandle->GPIO_PinConfig.GPIO_PinPuPdContol <<(2 *pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber));
	pGPIOHandle->pGPIOx->PUPDR &=~(0x3 << 2*pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber);			//clearing
	pGPIOHandle->pGPIOx->PUPDR |= temp;															//setting

	temp=0;
	//4. Configure the optype
	temp= (pGPIOHandle->GPIO_PinConfig.GPIO_PinOPType <<pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber);
	pGPIOHandle->pGPIOx->OTYPER &=~(0x1 << pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber);			//clearing
	pGPIOHandle->pGPIOx->OTYPER |= temp;														//setting

	//5. Configure the alt function
	if (pGPIOHandle->GPIO_PinConfig.GPIO_PinMode == GPIO_MODE_ALTFN)
	{
		//CONFIGURE ONLY IF THE ALT FUNCTION REGISTERS.
		uint8_t temp1,temp2;

		temp1 = pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber/8;
		temp2 = pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber%8;
		pGPIOHandle->pGPIOx->AFR[temp1] |= (0xF<< (4* temp2));													//clearing
		pGPIOHandle->pGPIOx->AFR[temp1] |= (pGPIOHandle->GPIO_PinConfig.GPIO_PinAltFunMode << (4* temp2));		//setting

	}

}



void GPIO_DeInit(GPIO_RegDef_t *pGPIOx)
{
	if(pGPIOx == GPIOA)
	{
		GPIOA_REG_RESET();
	}
	else if(pGPIOx ==GPIOB)
	{
		GPIOB_REG_RESET();
	}
	else if(pGPIOx ==GPIOC)
	{
		GPIOC_REG_RESET();
	}
	else if(pGPIOx ==GPIOD)
	{
		GPIOD_REG_RESET();
	}
	else if(pGPIOx ==GPIOE)
	{
		GPIOE_REG_RESET();
	}
	else if(pGPIOx ==GPIOF)
	{
		GPIOF_REG_RESET();
	}
	else if(pGPIOx ==GPIOG)
	{
		GPIOG_REG_RESET();
	}
	else if(pGPIOx ==GPIOH)
	{
		GPIOH_REG_RESET();
	}
}



uint8_t GPIO_ReadFromInputPin(GPIO_RegDef_t *pGPIOx, uint8_t PinNumber)
{
	uint8_t value;
	value = (uint8_t)((pGPIOx->IDR >> PinNumber)& 0x00000001);		//LSB is extracted by shifting and masking then finally type cased
	return value;
}



uint16_t GPIO_ReadFromInputPort(GPIO_RegDef_t *pGPIOx)
{
	uint16_t value;
	value = (uint16_t)pGPIOx->IDR;
	return value;
}


void GPIO_WriteToOutputPin(GPIO_RegDef_t *pGPIOx, uint8_t PinNumber, uint8_t Value)
{
	if(Value == GPIO_PIN_SET)
	{
		//write 1 to the output data register at the bit field corresponding to the pin value
		pGPIOx->ODR |= (1<<PinNumber);
	}
	else
	{
		pGPIOx->ODR &= ~(1<<PinNumber);
	}
}
void GPIO_WriteToOutputPort(GPIO_RegDef_t *pGPIOx,  uint16_t Value)
{
	pGPIOx->ODR= Value;
}
void GPIO_ToggleOutputPin(GPIO_RegDef_t *pGPIOx, uint8_t PinNumber)
{
	pGPIOx->ODR^=(1<<PinNumber);
}







void GPIO_IRQInterruptConfig(uint8_t IRQNumber,  uint8_t EnorDi)
{
	if(EnorDi == ENABLE)
	{
		if(IRQNumber <=31)
		{
			// program ISER0 register
			*NVIC_ISER0 |= (1<< IRQNumber);
		}
		else if(IRQNumber >31 && IRQNumber<64 )
		{
			// program ISER1 register
			*NVIC_ISER1 |= (1<< IRQNumber%32);
		}
		else if(IRQNumber>= 64 && IRQNumber<96)
		{
			// program ISER2 register
			*NVIC_ISER2 |= (1<< IRQNumber%64);
		}
	}
	else
	{
		if(IRQNumber <=31)
		{
			// program ICER0 register
			*NVIC_ICER0 |= (1<< IRQNumber);
		}
		else if(IRQNumber >31 && IRQNumber<64 )
		{
			// program ICER1 register
			*NVIC_ICER1 |= (1<< IRQNumber%32);

		}
		else if(IRQNumber>= 64 && IRQNumber<96)
		{
			// program ICER2 register
			*NVIC_ICER2 |= (1<< IRQNumber%64);
		}

	}
}

//void GPIO_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority)
//{
//	//1. First find the ipr register
//	uint8_t iprx = IRQNumber/4;
//	uint8_t iprx_section = IRQNumber%4;
//
//	uint8_t shift_amount = (8 * iprx_section) + (8 - NO_PR_BITS_IMPLEMENTED);
//	*(NVIC_PR_BASE_ADDR + iprx ) |= ( IRQPriority << shift_amount);
//}

void GPIO_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority)
{
    // 1. First, find the IPR register and section
    uint8_t iprx = IRQNumber / 4;  // IPR register
    uint8_t iprx_section = IRQNumber % 4;  // Section within the IPR register

    // 2. Calculate the shift amount
    uint8_t shift_amount = (8 * iprx_section) + (8 - NO_PR_BITS_IMPLEMENTED);

    // 3. Set the priority, first clear the section and then set the priority
    volatile uint32_t* ipr_base = (volatile uint32_t*)NVIC_PR_BASE_ADDR;
    ipr_base[iprx] &= ~(0xFF << (8 * iprx_section));  // Clear the section
    ipr_base[iprx] |= (IRQPriority << shift_amount);  // Set new priority
}



//void GPIO_IRQHandling(uint8_t PinNumber)
//{
//	//Clear the exti pr register corresponding to the pin number
//	if(EXTI->PR1 &(1<< PinNumber))
//	{
////		delay();
//		EXTI->PR1 |= (1<< PinNumber);
//	}
//}
//
void GPIO_IRQHandling(uint8_t PinNumber)
{
    // Check if the interrupt is pending
    if (EXTI->PR1 & (1 << PinNumber))
    {
        // Clear the EXTI PR1 register by writing a '1' to the corresponding bit
        EXTI->PR1 = (1 << PinNumber);
    }
}













